import pandas as pd
import numpy as np

def get_lvl_education(s):
    """ Функция возвращает уровень образования
    с учетом, соискатель указывает свой максимальный уровень образования 
    в первых трёх словах столбца «Образование и ВУЗ».

    Args:
        s: строка вида: <Уровень образования год выпуска ВУЗ специальность...>
    """
    s = s.lower()
    level = s.split()[:3]
    
    if 'высшее' in level[0]:
        return 'высшее'
    elif 'неоконченное' in level[0]:
        return 'неоконченное'
    elif 'специальное' in level[1]:
        return 'среднее специальное'
    elif 'среднее' in level[0]:
        return 'среднее'
    else:
        return pd.NA
    
    
def get_work_experience(s):
    """ Функция возвращает опыт работы в месяцах или NaN, если
    стоит значение "Не указано" или имеется пропуск

    Args:
        s: строка вида: 
        <Опыт работы: n лет m месяцев, периоды работы в различных компаниях…>
        NaN
        <Не указано>
    """
    if s is np.nan or s == 'Не указано':
        return np.nan
    # Списки слов - года и месяца
    year_list = ['год', 'года', 'лет']
    month_list = ['месяц', 'месяца', 'месяцев']
    s = s.split()[:6]
    year = 0
    month = 0
    # Цикл по индексам и словам
    for i, word in enumerate(s):
        # Если в списке слово из списка годов, то слово на 1 индекс меньше 
        # переводим в число и суммируем с годами
        if word in year_list:
            year += int(s[i-1])
         # Если в списке слово из списка месяцев, то слово на 1 индекс меньше 
        # переводим в число и суммируем с месяцами
        if word in month_list:
            month += int(s[i-1])
    return int(year*12 + month)


def get_city(s):
    """функция возвращает категорию к которой принадлежит город 
    ("Москва", "Санкт-Петербург", "город-миллионник" и "другие")

    Args:
        s (str): строка вида:
        <Город , (метро) , готовность к переезду (города для переезда) , готовность к командировкам>
    """
    million_cities = ['Новосибирск', 'Екатеринбург','Нижний Новгород',
                      'Казань', 'Челябинск','Омск', 'Самара', 'Ростов-на-Дону', 
                      'Уфа', 'Красноярск', 'Пермь', 'Воронеж','Волгоград']
    
    city = s.split(',')[0].strip()
    if city == 'Москва' or city == 'Санкт-Петербург':
        return city
    elif city in million_cities:
        return 'город-миллионник'
    else:
        return 'другие'
    
def get_ready_to_move(s):
    """функция возвращает значение True или False - готовность к переезду

    Args:
        s (str): строка вида:
        <Город , (метро) , готовность к переезду (города для переезда) , готовность к командировкам>
    """
    
    if ('не готова к переезду' in s) or ('не готов к переезду' in s):
        return False
    else: 
        return True
    
def get_ready_bisiness_trip(s):
    """функция возвращает True или False в зависимости от готовности 
    сосикателя к комадировкам

    Args:
        s (str): строка вида:
        <Город , (метро) , готовность к переезду (города для переезда) , готовность к командировкам>
    """
    
    if 'командировка' in s:
        if ('не готов к командировкам' in s) or ('не готова к командировкам') in s:
            return False
        else:
            return True
    else:
        return False
    
    
def get_name_iso(s):
    """функция возвращает названия валют, 
    которые необходимо преобразовать, в кодировке ISO
    """
    if s == 'бел.руб.':
        return 'BYN'
    elif s == 'грн.':
        return 'UAH'
    elif s == 'сум':
        return 'UZS'
    else:
        return s
    

    

